Repository: DanilaG/LowQualityApp
Catalog: LowQualityApp/LowQualityApp/Resources/*.lproj/Localizable.strings
Languages: ru

# list.title
source: Attributes
ru: Атрибуты

# list.section.functionalSuitability
source: Functional suitability
ru: Функциональная пригодность

# list.section.performanceEfficiency
source: Performance efficiency
ru: Эффективность работы

# list.section.compatibility
source: Compatibility
ru: Совместимость

# list.section.usability
source: Usability
ru: Удобство использования

# list.section.reliability
source: Reliability
ru: Надежность

# list.isoHint
source: The [ISO 25010](https://iso25000.com/index.php/en/iso-25000-standards/iso-25010?start=3) standard was utilized for the classification of quality attributes
ru: Для классификации атрибутов качества был использован стандарт [ISO 25010](https://iso25000.com/index.php/en/iso-25000-standards/iso-25010?start=3)

# description.description
source: Description
ru: Описание

# description.example
source: Example
ru: Пример

# description.application
source: Application
ru: Приложение

# description.task
source: Task
ru: Задача

# description.task.hint
source: Complete the designated task to identify the defect
ru: Выполните указанную задачу, чтобы обнаружить дефект

# description.try
source: Try
ru: Попробовать

# description.seeStandard
source: View the standard version
ru: Смотреть эталонную версию

# functionalCompleteness.title
source: Completeness
ru: Завершенность

# functionalCompleteness.description
source: degree to which the set of functions covers all the specified tasks and user objectives
ru: степень, в которой набор функций охватывает все указанные задачи и цели пользователя

# functionalCompleteness.task
source: Reduce the amount of savings
ru: Уменьшите количество сбережений

# functionalCompleteness.task.hint
source: The balance reduction function is currently unavailable in this version of the application as this functionality has not been implemented
ru: В данной версии приложения, функция уменьшения баланса недоступна из-за нереализованности данного функционала

# functionalCorrectness.title
source: Correctness
ru: Корректность

# functionalCorrectness.description
source: degree to which a product or system provides the correct results with the needed degree of precision
ru: степень, в которой продукт или система обеспечивают правильные результаты с необходимой точностью

# functionalCorrectness.task
source: Verify the history of operations with the total amount of savings
ru: Сравните истории операций с итоговой суммой накоплений

# functionalCorrectness.task.hint
source: In this version of the application, there is an error in calculating the total amount of savings
ru: В данной версии приложения присутствует ошибка при расчёте итоговой суммы накоплений

# functionalAppropriateness.title
source: Appropriateness
ru: Уместность

# functionalAppropriateness.description
source: degree to which the functions facilitate the accomplishment of specified tasks and objectives
ru: степень, в которой функции способствуют выполнению определенных задач и достижению определенных целей

# functionalAppropriateness.task
source: Verify the history of operations with the total amount of savings
ru: Сравните истории операций с итоговой суммой накоплений

# functionalAppropriateness.task.hint
source: In this version of the application, the total amount of savings is calculated in yuan. While this functionality may be highly valuable to a select few users, its appropriateness may be limited for the majority of users
ru: В данной версии приложения итоговая сумма накоплений рассчитывается в юанях. Такой функционал будет полезен только ограниченному числу пользователей. Для большинства пользователей степень уместности функционала будет небольшой

# timeBehaviour.title
source: Time behaviour
ru: Производительность

# timeBehaviour.description
source: degree to which the response and processing times and throughput rates of a product or system, when performing its functions, meet requirements
ru: степень, в которой время отклика, обработки и пропускная способность продукта или системы при выполнении их функций соответствуют требованиям

# timeBehaviour.task
source: Top up or withdraw funds
ru: Осуществите пополнение или изъятие средств

# timeBehaviour.task.hint
source: In this version of the application, it experience a delay in the initial screen loading time, as well as a processing delay when tapping certain buttons.
ru: В данной версии приложения загрузка изначального экрана занимает больше времени, а обработка нажатий некоторые кнопки происходит с задержкой

# resourceUtilization.title
source: Resource utilization
ru: Потребляемость ресурсов

# resourceUtilization.description
source: degree to which the amounts and types of resources used by a product or system, when performing its functions, meet requirements
ru: степень, в которой объемы и типы ресурсов, используемых продуктом или системой при выполнении своих функций, соответствуют требованиям

# resourceUtilization.task
source: Use the app for 5 minutes
ru: Используйте приложение на протяжении 5 минут

# resourceUtilization.task.hint
source: In this version of the application, location information will be collected. Additionally, excessive calculations are performed, which may result in device heating
ru: В данной версии приложения собирается информация о геопозиции, а также производятся излишние вычисления, что может приводить к нагреву устройства

# capacity.title
source: Capacity
ru: Ёмкость

# capacity.description
source: degree to which the maximum limits of a product or system parameter meet requirements
ru: степень, в которой максимальные пределы параметра продукта или системы соответствуют требованиям

# capacity.task
source: Find out the date of the initial deposit
ru: Определите дату первого пополнения

# capacity.task.hint
source: In this version of the application, there are jerky movements when scrolling through the history due to the large number of entries
ru: В данной версии приложения присутствуют проблемы с плавностью прокрутки истории из-за большого количества записей

# coExistence.title
source: Co-existence
ru: Сосуществование

# coExistence.description
source: degree to which a product can perform its required functions efficiently while sharing a common environment and resources with other products, without detrimental impact on any other product
ru: степень, в которой продукт может эффективно выполнять свои требуемые функции, используя общую среду и ресурсы с другими продуктами, без пагубного воздействия на любой другой продукт.

# coExistence.task
source: Top up or withdraw funds
ru: Осуществите пополнение или изъятие средств

# coExistence.task.hint
source: In this version of the application, a button overlaps the keyboard when entering the amount
ru: В данной версии приложения при вводе суммы возникает проблема перекрытия части кнопки клавиатурой

# interoperability.title
source: Interoperability
ru: Функциональная совместимость

# interoperability.description
source: degree to which two or more systems, products or components can exchange information and use the information that has been exchanged
ru: степень, в которой две или более систем, продуктов или компонентов могут обмениваться информацией и использовать полученную информацию

# interoperability.task
source: Top up or withdraw funds
ru: Осуществите пополнение или изъятие средств

# interoperability.task.hint
source: In this version of the application, after a top-up or withdrawal, the amount will be updated, but the "History" section will remain unchanged
ru: В данной версии приложения, после пополнения или изъятия средств, сумма будет обновлена, но раздел "История" не будет изменен соответствующим образом

# appropriatenessRecognizability.title
source: Appropriateness recognizability
ru: Узнаваемость назначения

# appropriatenessRecognizability.description
source: degree to which users can recognize whether a product or system is appropriate for their needs
ru: степень, в которой пользователи могут распознать, соответствует ли продукт или система их потребностям

# appropriatenessRecognizability.task
source: Guess the functionality of the "MoneyBox" app based on its name, and then give it a try to explore its features
ru: Попробуйте предположить, каким функционалом может обладать приложение "Копилка". После этого, запустите приложение

# appropriatenessRecognizability.task.hint
source: Despite its name, this application simplifies the process of dialing phone numbers for emergency services
ru: Данное приложение, несмотря на свое название, упрощает набор номера телефонов спецслужб

# learnability.title
source: Learnability
ru: Обучаемость

# learnability.description
source: degree to which a product or system can be used by specified users to achieve specified goals of learning to use the product or system with effectiveness, efficiency, freedom from risk and satisfaction in a specified context of use
ru: степень, в которой продукт или система могут использоваться определенными пользователями для достижения определенных целей обучения использованию продукта или системы с эффективностью, результативностью, свободой от риска и удовлетворением в определенном контексте использования

# learnability.task
source: Withdraw an amount exceeding the available funds
ru: Изымите сумму, превышающую средства на счёте

# learnability.task.hint
source: In this version of the application, there is no description provided for withdrawal or top-up errors
ru: В данной версии приложения отсутствует описание ошибок при снятии или пополнении средств

# operability.title
source: Operability
ru: Операбельность

# operability.description
source: degree to which a product or system has attributes that make it easy to operate and control
ru: степень, в которой продукт или система обладают свойствами, облегчающими их эксплуатацию и контроль

# operability.task
source: Top up or withdraw funds
ru: Осуществите пополнение или изъятие средств

# operability.task.hint
source: In this version of the application, the keyboard does not open automatically, and the action buttons are positioned too low
ru: В данной версии приложения клавиатура не открывается автоматически, а кнопки являются чрезмерно узкими

# userErrorProtection.title
source: User error protection
ru: Защита от ошибок

# userErrorProtection.description
source: degree to which a system protects users against making errors
ru: степень, в которой система защищает пользователей от совершения ошибок

# userErrorProtection.task
source: Withdraw an amount exceeding the available funds
ru: Изымите сумму, превышающую средства на счёте

# userErrorProtection.task.hint
source: In this version of the application, you have the ability to withdraw funds that exceed your budget
ru: В данной версии приложения, доступно снятие средств, превышающих бюджет

# userInterfaceAesthetics.title
source: User interface aesthetics
ru: Эстетичность

# userInterfaceAesthetics.description
source: degree to which a user interface enables pleasing and satisfying interaction for the user
ru: степень, в которой пользовательский интерфейс обеспечивает приятное взаимодействие для пользователя

# userInterfaceAesthetics.task
source: Find out the date of the initial deposit
ru: Определите дату первого пополнения

# userInterfaceAesthetics.task.hint
source: In this version of the application, there are issues with margins and fonts in the operation history
ru: В данной версии приложения имеются проблемы с отступами и шрифтами в истории операций

# accessibility.title
source: Accessibility
ru: Доступность интерфейса

# accessibility.description
source: degree to which a product or system can be used by people with the widest range of characteristics and capabilities to achieve a specified goal in a specified context of use
ru: степень, в которой продукт или система могут использоваться людьми с ограниченными возможностями для достижения определенной цели в определенном контексте использования

# accessibility.task
source: Find out the date of the initial deposit
ru: Определите дату первого пополнения

# accessibility.task.hint
source: In this version of the application, some of the text in the history section is not clearly visible
ru: В данной версии приложения часть текста в истории плохо читаема из-за плохой видимости

# maturity.title
source: Maturity
ru: Зрелость

# maturity.description
source: degree to which a system, product or component meets needs for reliability under normal operation
ru: степень, в которой система, изделие или компонент удовлетворяют требованиям надежности при нормальной эксплуатации

# maturity.task
source: Top up your balance three times
ru: Пополните баланс трижды

# maturity.task.hint
source: In this version of the application, a fatal error occurs when attempting the second or third top-up
ru: В данной версии приложения возникает фатальная ошибка при втором/третьем пополнении

# availability.title
source: Availability
ru: Доступность функциональности

# availability.description
source: degree to which a system, product or component is operational and accessible when required for use
ru: степень, в которой система, продукт или компонент работоспособны и доступны для использования, когда это требуется

# availability.task
source: Top up or withdraw funds
ru: Осуществите пополнение или изъятие средств

# availability.task.hint
source: In this version of the application, the functionality for top-up and withdrawal is unavailable
ru: В данной версии приложения функция пополнения/изъятия средств недоступна

# faultTolerance.title
source: Fault tolerance
ru: Отказоустойчивость

# faultTolerance.description
source: degree to which a system, product or component operates as intended despite the presence of hardware or software faults
ru: степень, в которой система, продукт или компонент работают должным образом, несмотря на наличие аппаратных или программных сбоев

# faultTolerance.task
source: Withdraw an amount exceeding the available funds
ru: Изымите сумму, превышающую средства на счёте

# faultTolerance.task.hint
source: In this version of the application, if an error occurs, the application crashes
ru: В данной версии приложения при возникновении ошибки происходит аварийное завершение работы приложения

# recoverability.title
source: Recoverability
ru: Восстанавливаемость

# recoverability.description
source: degree to which, in the event of an interruption or a failure, a product or system can recover the data directly affected and re-establish the desired state of the system
ru: степень, в которой в случае прерывания или сбоя продукт или система могут восстановить непосредственно затронутые данные и восстановить желаемое состояние системы

# recoverability.task
source: Top up or withdraw funds. Then re-enter the application
ru: Осуществите пополнение или изъятие средств. После чего перезайдите в приложение

# recoverability.task.hint
source: In this version of the application, if an fatal error occurs, the saved data is lost.
ru: В данной версии приложения, после аварийного завершения, возникает потеря сохраненных данных

# sampleApp.moneyBox.title
source: MoneyBox
ru: Копилка

# sampleApp.moneyBox.description
source: Savings accounting application
ru: Приложение для учёта накоплений

# sampleApp.moneyBox.savings
source: Savings
ru: Накоплено

# sampleApp.moneyBox.actions
source: Actions
ru: Действия

# sampleApp.moneyBox.topUp.title
source: Top Up
ru: Пополнение

# sampleApp.moneyBox.topUp.hint
source: Specify the amount (in USD) and the date of enrollment
ru: Укажите сумму (в USD) и дату зачисления

# sampleApp.moneyBox.topUp.action
source: Top Up
ru: Пополнить

# sampleApp.moneyBox.withdraw.title
source: Withdraw
ru: Изъятие

# sampleApp.moneyBox.withdraw.hint
source: Specify the amount (in USD) and the date of withdrawal
ru: Укажите сумму (в USD) и дату списания

# sampleApp.moneyBox.withdraw.action
source: Withdraw
ru: Изъять

# sampleApp.moneyBox.history
source: History
ru: История

# sampleApp.moneyBox.sum
source: Amount
ru: Сумма

# sampleApp.moneyBox.date
source: Date
ru: Дата

# sampleApp.moneyBox.sumForm.alert.ok
source: Ok
ru: Ок

# sampleApp.moneyBox.error
source: Error
ru: Ошибка

# sampleApp.moneyBox.error.invalidAmount
source: Invalid Amount
ru: Неверная сумма

# sampleApp.moneyBox.error.unavailable
source: The service is temporarily unavailable, try again later
ru: Сервис временно недоступен, попробуйте позже

# sampleApp.moneyBox.error.topUp.lessOrEqualZero
source: The top up amount must be greater than zero
ru: Сумма пополнения должна быть больше нуля

# sampleApp.moneyBox.error.withdraw.lessOrEqualZero
source: The withdraw amount must be greater than zero
ru: Сумма изъятия должна быть больше нуля

# sampleApp.moneyBox.error.withdraw.moreThenTotalSum
source: The withdrawal amount exceeds the balance as of %@. Note that %@ is the maximum allowable amount for withdrawal on the selected date.
ru: Сумма изъятия превышает сумму счёта на %@ Допустимая сумма для изъятия на выбранную дату %@

# sampleApp.moneyBox.error.stringToDecimal
source: Failed to get the value
ru: Не удалось получить значение

# sampleApp.callTo.moneyBox.title
source: Money Box
ru: Коп Илл-ка

# sampleApp.callTo.moneyBox.title.short
source: MoneyBox
ru: Копилка

# sampleApp.callTo.moneyBox.description
source: application for calling special services
ru: приложение для вызова полиции или скорой помощи

# sampleApp.callTo.moneyBox.action
source: Call
ru: Вызвать спецслужбу
