Repository: DanilaG/LowQualityApp
Catalog: LowQualityApp/BugHubApp/Resources/*.lproj/Localizable.strings
Languages: ru

# list.title
source: Attributes
ru: Атрибуты

# list.section.functionalSuitability
source: Functional suitability
ru: Функциональная пригодность

# list.section.performanceEfficiency
source: Performance efficiency
ru: Уровень производительности

# list.section.compatibility
source: Compatibility
ru: Совместимость

# list.section.usability
source: Usability
ru: Удобство использования

# list.section.reliability
source: Reliability
ru: Надежность

# list.isoHint
source: The [ISO 25010](https://iso25000.com/index.php/en/iso-25000-standards/iso-25010?start=3) standard was utilized for the classification of quality attributes
ru: Для классификации атрибутов качества был использован стандарт [ISO 25010](https://iso25000.com/index.php/en/iso-25000-standards/iso-25010?start=3). Перевод базируется на [ГОСТ Р ИСО/МЭК 25010-2015](https://protect.gost.ru/document.aspx?control=7&id=200427)

# description.description
source: Description
ru: Описание

# description.example.button
source: Example of Violation
ru: Пример нарушения

# description.example.button.hint
source: Explore the example of a quality attribute violation to enhance your understanding of its value
ru: Изучите пример нарушения атрибута качества, для улучшения понимания его значимость

# description.example.title
source: Example
ru: Пример

# description.example.context
source: Context
ru: Контекст

# description.example.task
source: Task
ru: Задача

# description.example.task.hint
source: Complete the designated task to identify the defect
ru: Выполните указанную задачу, чтобы обнаружить дефект

# description.example.defect
source: Defect
ru: Дефект

# description.example.defect.hint
source: The defect demonstrates a violation of the quality attribute "%@" in the given context
ru: Дефект демонстрирует нарушение атрибута качества «%@» в данном контексте

# description.example.try
source: Try
ru: Испытать

# description.example.try.hint
source: If needed, refer to the [standard application version](standard_app)
ru: При необходимости обратитесь к [эталонной реализации](standard_app)

# functionalCompleteness.title
source: Completeness
ru: Полнота

# functionalCompleteness.description
source: degree to which the set of functions covers all the specified tasks and user objectives
ru: степень покрытия совокупностью функций всех определенных задач и целей пользователя

# functionalCompleteness.context
source: After making a purchase, you want to record it in the financial control application
ru: Вы совершили покупку и хотите отразить её в приложение для финансового контроля

# functionalCompleteness.task
source: Reduce the amount of savings
ru: Добавьте расход средств

# functionalCompleteness.defect
source: The app does not have a function to reduce the balance; you can only increase the balance
ru: В приложении отсутствует функция добавления расходов, вы можете добавить только доход

# functionalCorrectness.title
source: Correctness
ru: Корректность

# functionalCorrectness.description
source: degree to which a product or system provides the correct results with the needed degree of precision
ru: степень, в которой продукт или система обеспечивают правильные результаты с необходимой точностью

# functionalCorrectness.context
source: You have noticed that the amount of your savings is not matching the balance in the application. As a result, you have decided to verify the balance by reviewing the transaction history
ru: Вы заметили, что сумма ваших сбережений не совпадает с суммой, указанной в приложении для финансового контроля. В связи с этим, вы решили проверить баланс, основываясь на истории операций

# functionalCorrectness.task
source: View the transaction history and calculate your savings, then comparing the outcome with the savings displayed in the application
ru: Просмотрите историю операций и рассчитайте сумму накоплений, затем сравните полученный результат с указанной суммой в приложении

# functionalCorrectness.defect
source: There is an error in the application's calculation of the total savings amount. Despite making two deposits totaling $ 3 000, the balance reflects a significantly lower mount
ru: В приложения присутствует ошибка при расчёте итоговой суммы накоплений. Несмотря на доходы общей суммой в 3 000 $, баланс в приложении ниже данного значения

# functionalAppropriateness.title
source: Appropriateness
ru: Целесообразность

# functionalAppropriateness.description
source: degree to which the functions facilitate the accomplishment of specified tasks and objectives
ru: степень функционального упрощения выполнения определенных задач и достижения целей

# functionalAppropriateness.context
source: You have noticed that the amount of your savings is not matching the balance in the application. As a result, you have decided to verify the balance by reviewing the transaction history
ru: Вы заметили, что сумма ваших сбережений не совпадает с суммой, указанной в приложении для финансового контроля. В связи с этим, вы решили проверить баланс, основываясь на истории операций

# functionalAppropriateness.task
source: View the transaction history and calculate your savings, then comparing the outcome with the savings displayed in the application
ru: Просмотрите историю операций и рассчитайте сумму накоплений, затем сравните полученный результат с указанной суммой в приложении

# functionalAppropriateness.defect
source: In the application, the total savings amount is calculated in yuan, although all other amounts are displayed in dollars. This feature may be beneficial to only a select number of users, as the appropriateness of this functionality for most users will be limited
ru: В приложении итоговая сумма накоплений рассчитывается в юанях, несмотря на то, что все остальные суммы указаны в долларах. Этот функционал может быть полезен только ограниченному числу пользователей, в то время как для большинства пользователей целесообразность функционала будет небольшой

# timeBehaviour.title
source: Time behaviour
ru: Временные характеристики

# timeBehaviour.description
source: degree to which the response and processing times and throughput rates of a product or system, when performing its functions, meet requirements
ru: степень соответствия требованиям по времени отклика, времени обработки и показателей пропускной способности продукта или системы

# timeBehaviour.context
source: After receiving your salary, you want to reflect it in the financial control application
ru: Вы получили зарплату и хотите отразить её в приложение для финансового контроля

# timeBehaviour.task
source: Top up funds
ru: Добавьте доход

# timeBehaviour.defect
source: The application has an excessive loading time, and there is a noticeable delay when processing clicks on certain buttons
ru: Приложение загружается слишком долго, а обработка нажатий на некоторые кнопки происходит с значительной задержкой

# resourceUtilization.title
source: Resource utilization
ru: Использование ресурсов

# resourceUtilization.description
source: degree to which the amounts and types of resources used by a product or system, when performing its functions, meet requirements
ru: степень удовлетворения требований по потреблению объемов и видов ресурсов продуктом или системой при выполнении их функций

# resourceUtilization.context
source: Upon returning from vacation, you have made the decision to record all your expenses during that period in the financial control application
ru: После возвращения из отпуска вы решили учесть все свои расходы за это время в приложении для финансового контроля

# resourceUtilization.task
source: Use the app for 5 minutes
ru: Используйте приложение на протяжении 5 минут

# resourceUtilization.defect
source: The application collects unnecessary information about the device's geo-location. Additionally, it performs unnecessary calculations during use, which can result in device heating
ru: Приложение получает информацию о геопозиции, что является излишним. А также в процессе использования происходят ненужные вычисления, что может приводить к нагреву устройства

# capacity.title
source: Capacity
ru: Потенциальные возможности

# capacity.description
source: degree to which the maximum limits of a product or system parameter meet requirements
ru: степень соответствия требованиям предельных значений параметров продукта или системы

# capacity.context
source: You have been using the same financial control application for quite some time and now you are curious to know when you first added an entry to it
ru: Вы долгое время пользуетесь одним и тем же приложением для финансового контроля и вам стало любопытно, когда вы впервые добавили запись в него

# capacity.task
source: Find out the date of the initial deposit
ru: Определите дату первого дохода

# capacity.defect
source: The application experiences issues with smooth scrolling of the history due to the large number of entries
ru: В приложении возникают проблемы с плавностью прокрутки истории из-за большого количества записей

# coExistence.title
source: Co-existence
ru: Сосуществование

# coExistence.description
source: degree to which a product can perform its required functions efficiently while sharing a common environment and resources with other products, without detrimental impact on any other product
ru: способность продукта совместно функционировать с другими независимыми продуктами в общей среде с разделением общих ресурсов и без отрицательного влияния на любой другой продукт

# coExistence.context
source: After receiving your salary, you want to reflect it in the financial control application
ru: Вы получили зарплату и хотите отразить её в приложение для финансового контроля

# coExistence.task
source: Top up funds
ru: Осуществите пополнение средств

# coExistence.defect
source: When entering the amount, the top-up button is partially obscured by the keyboard
ru: При вводе суммы часть кнопки пополнения заслоняется клавиатурой

# interoperability.title
source: Interoperability
ru: Функциональная совместимость

# interoperability.description
source: degree to which two or more systems, products or components can exchange information and use the information that has been exchanged
ru: способность двух или более систем, продуктов или компонент обмениваться информацией и использовать такую информацию

# interoperability.context
source: After receiving your salary, you want to reflect it in the financial control application
ru: Вы получили зарплату и хотите отразить её в приложение для финансового контроля

# interoperability.task
source: Top up funds and verify results
ru: Добавьте доход и проверьте результат

# interoperability.defect
source: After making a top-up, the amount will be updated, but the "History" section will not reflect this change
ru: После добавления дохода, сумма будет обновлена, но раздел "История" не будет изменен соответствующим образом

# appropriatenessRecognizability.title
source: Appropriateness recognizability
ru: Определимость пригодности

# appropriatenessRecognizability.description
source: degree to which users can recognize whether a product or system is appropriate for their needs
ru: возможность пользовате­лей понять, подходит ли продукт или система для их потребностей

# appropriatenessRecognizability.context
source: You have recently installed a new app on your mobile phone called "MoneyBox" and now you are ready to launch it
ru: Вы добавили в свой мобильный телефон новое приложение под названием "Копилка" и готовы запустить его

# appropriatenessRecognizability.task
source: Guess the functionality of the "MoneyBox" app based on its name, and then give it a try to explore its features
ru: Попробуйте предположить, каким функционалом может обладать приложение "Копилка". После этого, запустите приложение

# appropriatenessRecognizability.defect
source: Despite its name, this application simplifies the process of dialing phone numbers for emergency services
ru: Приложение, несмотря на свое название, упрощает набор номера телефонов спецслужб

# learnability.title
source: Learnability
ru: Изучаемость

# learnability.description
source: degree to which a product or system can be used by specified users to achieve specified goals of learning to use the product or system with effectiveness, efficiency, freedom from risk and satisfaction in a specified context of use
ru: степень, в которой продукт или система могут использоваться определенными пользователями для достижения определенных целей обучения использованию продукта или системы с эффективностью, результативностью, свободой от риска и удовлетворением в определенном контексте использования

# learnability.context
source: You have incurred expenses amounting to $ 10 000 and now want to reflect these costs within the financial control application
ru: Вы потратили 10 000 $ и хотите отразить эти траты в приложении для финансового контроля

# learnability.task
source: Withdraw an amount exceeding the available funds
ru: Добавьте расход, превышающую общую сумму накоплений

# learnability.defect
source: If you attempt to withdraw an amount greater than the funds available in your account, the application will display an error message without providing an explanation for the occurrence
ru: При попытке добавить расход, превышающую общую сумму накоплений, приложение выдаст ошибку без объяснения причины

# operability.title
source: Operability
ru: Управляемость

# operability.description
source: degree to which a product or system has attributes that make it easy to operate and control
ru: наличие в продукте или системе атрибутов, обеспечивающих простое управление и контроль

# operability.context
source: After receiving your salary, you want to reflect it in the financial control application
ru: Вы получили зарплату и хотите отразить её в приложение для финансового контроля

# operability.task
source: Top up funds
ru: Добавьте доход

# operability.defect
source: The application does not automatically open the keyboard for entering amounts, while the confirmation button appears excessively narrow
ru: В приложении отсутствует автоматическое открытие клавиатуры для ввода суммы, а кнопка добавления является слишком узкой

# userErrorProtection.title
source: User error protection
ru: Защищенность от ошибки пользователя

# userErrorProtection.description
source: degree to which a system protects users against making errors
ru: степень, в которой система защищает пользователей от совершения ошибок

# userErrorProtection.context
source: You have incurred expenses amounting to $ 10 000 and now want to reflect these costs within the financial control application
ru: Вы потратили 10 000 $ и хотите отразить эти траты в приложении для финансового контроля

# userErrorProtection.task
source: Withdraw an amount exceeding the available funds
ru: Добавьте расход, превышающую общую сумму накоплений

# userErrorProtection.defect
source: The application permits users to get a negative balance
ru: Приложение допускает наличие отрицательного баланса у пользователя

# userInterfaceAesthetics.title
source: User interface aesthetics
ru: Эстетика пользовательского интерфейса

# userInterfaceAesthetics.description
source: degree to which a user interface enables pleasing and satisfying interaction for the user
ru: степень, в которой пользовательский интерфейс обеспечивает приятное взаимодействие для пользователя

# userInterfaceAesthetics.context
source: You have decided to analyze your income and determine the date of the largest deposit
ru: Вы решили проанализировать свою доходность и выявить дату с наибольшим доходом в приложении для финансового контроля

# userInterfaceAesthetics.task
source: Identify the date with the highest amount of fund replenishment
ru: Определите дату наибольшего дохода

# userInterfaceAesthetics.defect
source: The application is experiencing issues related to margin and font formatting in the operation history
ru: В приложении имеются проблемы с отступами и шрифтами в истории операций

# accessibility.title
source: Accessibility
ru: Доступность интерфейса

# accessibility.description
source: degree to which a product or system can be used by people with the widest range of characteristics and capabilities to achieve a specified goal in a specified context of use
ru: степень, в которой продукт или система могут использоваться людьми с ограниченными возможностями для достижения определенной цели в определенном контексте использования

# accessibility.context
source: You have decided to analyze your income and determine the date of the largest deposit
ru: Вы решили проанализировать свою доходность и выявить дату с наибольшим доходом в приложении для финансового контроля

# accessibility.task
source: Identify the date with the highest amount of fund replenishment
ru: Определите дату наибольшего дохода

# accessibility.defect
source: The date and amount in the history of operations in the application are challenging to read due to the insufficient contrast with the background, causing significant difficulties for individuals with visual impairments
ru: В приложении дата и сумма в истории операций плохо читаема из-за недостаточной контрастности с фоном, что создает значительные трудности для людей с проблемами со зрением

# maturity.title
source: Maturity
ru: Зрелость

# maturity.description
source: degree to which a system, product or component meets needs for reliability under normal operation
ru: степень, в которой система, изделие или компонент удовлетворяют требованиям надежности при нормальной эксплуатации

# maturity.context
source: Upon returning from vacation, you have made the decision to record all your expenses during that period in the financial control application
ru: После возвращения из отпуска вы решили учесть все свои расходы за это время в приложении для финансового контроля

# maturity.task
source: Top up or decrease your balance 4 times
ru: Добавьте доход или расход 4 раза

# maturity.defect
source: The application encounters a critical error during the second or third top up or withdrawal process
ru: В приложении возникает критическая ошибка при втором или третьем добавлении

# availability.title
source: Availability
ru: Доступность функциональности

# availability.description
source: degree to which a system, product or component is operational and accessible when required for use
ru: степень, в которой система, продукт или компонент работоспособны и доступны для использования, когда это требуется

# availability.context
source: After receiving your salary, you want to reflect it in the financial control application
ru: Вы получили зарплату и хотите отразить её в приложение для финансового контроля

# availability.task
source: Top up funds
ru: Добавьте доход

# availability.defect
source: The functionality for top-up and withdrawal are unavailable in the application
ru: В приложении функции добавления недоступны

# faultTolerance.title
source: Fault tolerance
ru: Отказоустойчивость

# faultTolerance.description
source: degree to which a system, product or component operates as intended despite the presence of hardware or software faults
ru: степень, в которой система, продукт или компонент работают должным образом, несмотря на наличие аппаратных или программных сбоев

# faultTolerance.context
source: You have incurred expenses amounting to $ 10 000 and now want to reflect these costs within the financial control application
ru: Вы потратили 10 000 $ и хотите отразить эти траты в приложении для финансового контроля

# faultTolerance.task
source: Withdraw an amount exceeding the available funds
ru: Добавьте расход, превышающую общую сумму накоплений

# faultTolerance.defect
source: In the application, when an error occurs, it crashes
ru: В приложении при возникновении ошибки происходит аварийное завершение работы приложения

# recoverability.title
source: Recoverability
ru: Восстанавливаемость

# recoverability.description
source: degree to which, in the event of an interruption or a failure, a product or system can recover the data directly affected and re-establish the desired state of the system
ru: способность продукта или системы восстановить данные и требуемое состояние системы в случае прерывания или сбоя

# recoverability.context
source: While using the financial control application, it unexpectedly terminated. Now you're attempting to restart the app
ru: В процессе использования приложения для финансового контроля оно неожиданно завершилось. Вы пытаетесь перезапустить приложение

# recoverability.task
source: Top up funds. Then re-enter the application
ru: Добавьте доход. После чего перезайдите в приложение

# recoverability.defect
source: When the application crashes, data loss occurs
ru: При аварийном завершении приложения возникает потеря сохраненных данных

# sampleApp.moneyBox.title
source: MoneyBox
ru: Копилка

# sampleApp.moneyBox.description
source: Savings accounting application
ru: Приложение для учёта накоплений

# sampleApp.moneyBox.savings
source: Savings
ru: Накоплено

# sampleApp.moneyBox.actions
source: Actions
ru: Добавить

# sampleApp.moneyBox.topUp.title
source: Top Up
ru: Доход

# sampleApp.moneyBox.topUp.hint
source: Specify the amount (in USD) and the date of enrollment
ru: Укажите сумму (в USD) и дату поступления

# sampleApp.moneyBox.topUp.action
source: Top Up
ru: Добавить

# sampleApp.moneyBox.withdraw.title
source: Withdraw
ru: Расход

# sampleApp.moneyBox.withdraw.hint
source: Specify the amount (in USD) and the date of withdrawal
ru: Укажите сумму (в USD) и дату расхода

# sampleApp.moneyBox.withdraw.action
source: Withdraw
ru: Добавить

# sampleApp.moneyBox.history
source: History
ru: История

# sampleApp.moneyBox.sum
source: Amount
ru: Сумма

# sampleApp.moneyBox.date
source: Date
ru: Дата

# sampleApp.moneyBox.sumForm.alert.ok
source: Ok
ru: Ок

# sampleApp.moneyBox.error
source: Error
ru: Ошибка

# sampleApp.moneyBox.error.invalidAmount
source: Invalid Amount
ru: Неверная сумма

# sampleApp.moneyBox.error.unavailable
source: The service is temporarily unavailable, try again later
ru: Сервис временно недоступен, попробуйте позже

# sampleApp.moneyBox.error.topUp.lessOrEqualZero
source: The top up amount must be greater than zero
ru: Сумма дохода должна быть больше нуля

# sampleApp.moneyBox.error.withdraw.lessOrEqualZero
source: The withdraw amount must be greater than zero
ru: Сумма расхода должна быть больше нуля

# sampleApp.moneyBox.error.withdraw.moreThenTotalSum
source: The withdrawal amount exceeds the balance as of %@. Note that %@ is the maximum allowable amount for withdrawal on the selected date.
ru: Сумма расхода превышает сумму счёта на %@ Допустимая сумма на выбранную дату %@

# sampleApp.moneyBox.error.stringToDecimal
source: Failed to get the value
ru: Не удалось получить значение

# sampleApp.callTo.moneyBox.title
source: Money Box
ru: Коп Илл-ка

# sampleApp.callTo.moneyBox.title.short
source: MoneyBox
ru: Копилка

# sampleApp.callTo.moneyBox.description
source: application for calling special services
ru: приложение для вызова полиции или скорой помощи

# sampleApp.callTo.moneyBox.action
source: Call
ru: Вызвать спецслужбу
